// Module
import 'package:flutter/material.dart';

// Model
import '../models/manual.model.dart';

List<Manual> manualList = [
  Manual(
    title: "คุณภาพน้ำสําหรับเพาะเลี้ยงสัตว์น้ำชายฝั่ง",
    color: const Color.fromARGB(255, 229, 58, 100),
    column: ["ดัชนีคุณภาพน้้า", "ค่าที่ควรเฝ้าระวัง", "หน่วย"],
    row: [
      ["อุณหภูมิ(Temp)", "28 - 32", "°C"],
      ["ความเป็นกรดและด่าง(pH)", "7.0 - 8.3", "pH"],
      ["ความเค็ม(Salinity)", "0.5 - 35", "ppt"],
      ["แอมโมเนีย(NH3-N)", "≤ 0.4", "mg/l"],
      ["ไนไตรท์(NO2)", "< 0.1", "mg/l"],
      ["ไนเตรท(NO3)", "< 5.0", "mg/l"],
      ["ออกซิเจนละลายน้ำ(DO)", "> 5", "mg/l"],
    ],
  ),
  Manual(
    title: "คุณภาพน้ำสำหรับปลูกพืชผลไม้",
    color: const Color.fromARGB(255, 40, 53, 81),
    column: ["ระดับค่า pH", "ความเสี่ยง", "ผลกระทบ"],
    row: [
      ["pH < 4.0", "อันตราย", "อาจทําให้ปลาตายได้"],
      ["pH 4.0 - 6.0", "ไม่เหมาะสม", "ปลาบางชนิด รอดชีวิตได้ แต่ผลผลิตต่ำ การเจริญเติบโตช้า และสืบพันธุ์ชะงัก"],
      ["pH 6.5 - 9.0", "เหมาะสม", "เหมาะสำหรับการเพาะเลี้ยงสัตว์น้ำ"],
      ["pH 9.0 - 11.0", "ไม่เหมาะสมในระยะยาว", "อาจเป็นพิษต่อชีวิตของสัตว์น้ำ"],
      ["pH > 11.0", "พิษ", "มีพิษต่อปลา"],
    ],
  ),
  Manual(
    title: "คุณภาพของน้ำสำหรับการเลี้ยงกุ้งขาว",
    color: const Color.fromARGB(255, 247, 148, 31),
    column: ["ดัชนีคุณภาพน้้า", "ค่าที่เหมาะสม", "หน่วย"],
    row: [
      ["ค่าความเป็นกรดเป็นด่าง(pH)", "7.5 - 8.5", "pH"],
      ["ค่าความเป็นด่าง(Alkalinity)", "80 - 160", "มก./ลิตร"],
      ["ความเค็ม(Salinity)", "10 - 30", "ส่วนในพันส่วน"],
      ["ปริมาณออกซิเจนที่ละลายน้ำ(DO)", "มากกว่า 5", "มก./ลิตร"],
      ["แอมโมเนีย(NH3)", "ไม่ควรเกิน 0.1", "มก./ลิตร"],
      ["ไนเตรท(NO3)", "ไม่ควรเกิน 0.1", "มก./ลิตร"]
    ],
  ),
  Manual(
    title: "คุณภาพน้ำสำหรับการเพาะเลี้ยงปลาในกระชัง",
    color: const Color.fromARGB(255, 163, 183, 62),
    column: ["คุณสมบัตินํ้า", "ค่าที่เหมาะสม", "ผลกระทบหากไม่เหมาะสม"],
    row: [
      ["อุณหภูมิ", "19 - 29 °C", "อยู่ได้ไม่นานและอาจตายได้ ไม่กินอาหาร โตช้า ไม่วางไข่"],
      ["ความเค็ม", "< 10 ppt", "โตช้า เครียด"],
      ["ความเป็นกรด-ด่าง", "6.5 - 8.5", "โตช้า อ่อนแอ"],
      ["ปริมาณออกซิเจน", "> 1 ppm", "ปลาลอยหัว เครียด โตช้า"],
      ["แอมโมเนียและไนไตรท์", "< 0.02 ppm", "เป็นพิษ ทําให้ปลาตาย"],
      ["ไฮโดรเจนซัลไฟด์", "< 0.002 ppm", "เป็นพิษ ทําให้ปลาตาย"],
      ["คาร์บอนไดออกไซด์", "< 70 ppm", "เป็นพิษ ทําให้ปลาตาย"],
      ["สารแขวนลอยและตะกอน", "มากเกินไป", "ออกซิเจนต่ํา แอมโมเนีย/คาร์บอนไดออกไซด์/ไฮโดรเจนซัลไฟด์ สูง"],
      ["ปริมาณแพลงตอนพืช", "มากเกินไป", "ออกซิเจนต่ํา แอมโมเนีย/คาร์บอนไดออกไซด์/ไฮโดรเจนซัลไฟด์ สูง"],
    ],
  ),
];
